# .MAP()

La función map() mapea una columna de un dataframe o un series de pandas en vase a un criterio, se puede usar una función normal, se puede usar una función lambda o se puede usar un diccionario.

In [1]:
import numpy as np
import pandas as pd

## cargando df

In [7]:
path = 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data'

df = pd.read_csv(path, delim_whitespace=True, header=None,
            names = ['mpg', 'cilindros', 'desplazamiento','potencia',
            'peso', 'aceleracion', 'año', 'origen', 'nombre'],
            na_values='?')

df.head(10)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
5,15.0,8,429.0,198.0,4341.0,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220.0,4354.0,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215.0,4312.0,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl

In [23]:
df.año.unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], dtype=int64)

## ejemplo simple con un pandas series

In [3]:
s = pd.Series(['cat','dog','NaN','rabbit'])

s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [4]:
mapping_dict = {'cat':'kitty', 'dog':'puppy'}

s.map(mapping_dict)

0    kitty
1    puppy
2      NaN
3      NaN
dtype: object

In [6]:
s # no cambia la serie original, no tiene metodo inplace

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

## map con una función normal

### Al estilo apply()

In [8]:
def cambiar_palabra(palabra):
    return palabra.replace('amc', 'AMC')   # donde se encuentra amc, lo pasara a AMC

df['nombre'].map(cambiar_palabra)

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  AMC rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: nombre, Length: 398, dtype: object

### Función matemática

## para ignorar Nans

In [17]:
def funcion(el_contenido_de_la_columna):
    pass

df['nombre'].map(funcion, na_action= 'ignore') # si se encuentra Nans los ignora

0      None
1      None
2      None
3      None
4      None
       ...
393    None
394    None
395    None
396    None
397    None
Name: nombre, Length: 398, dtype: object

## con funcion lambda

In [19]:
df.head()

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [27]:
df['es_viejo'] = df['año'].map(lambda x: 'viejo' if x <= 75   else 'no tan viejo')

In [28]:
df.sample(5)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre,es_viejo
326,43.4,4,90.0,48.0,2335.0,23.7,80,2,vw dasher (diesel),no tan viejo
292,18.5,8,360.0,150.0,3940.0,13.0,79,1,chrysler lebaron town @ country (sw),no tan viejo
283,20.2,6,232.0,90.0,3265.0,18.2,79,1,amc concord dl 6,no tan viejo
133,16.0,6,250.0,100.0,3781.0,17.0,74,1,chevrolet chevelle malibu classic,viejo
102,26.0,4,97.0,46.0,1950.0,21.0,73,2,volkswagen super beetle,viejo

## con un diccionario

In [31]:
dicc = {70:'muy_pellejo',
        72: 'no_demasiado_pellejo', 
        74:'viejo',
        76: 'pasado_de_moda',
        78: 'old_school',
        80: 'just_flow',
        82: 'tienes estilo'}

# los valores fuera del dicc (71,73,75, etc.) se les asignará NaN

df['es_viejo'] = df['año'].map(dicc)

In [32]:
df.sample(5)

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre,es_viejo
260,18.6,6,225.0,110.0,3620.0,18.7,78,1,dodge aspen,old_school
262,19.2,8,305.0,145.0,3425.0,13.2,78,1,chevrolet monte carlo landau,old_school
243,21.5,3,80.0,110.0,2720.0,13.5,77,3,mazda rx-4,NaN
71,19.0,3,70.0,97.0,2330.0,13.5,72,3,mazda rx2 coupe,no_demasiado_pellejo
93,14.0,8,318.0,150.0,4237.0,14.5,73,1,plymouth fury gran sedan,NaN

## añadiendo texto a una columna

In [11]:
df['nombre'].map('el nombre del coche es: {}'.format)

0      el nombre del coche es: chevrolet chevelle malibu
1              el nombre del coche es: buick skylark 320
2             el nombre del coche es: plymouth satellite
3                  el nombre del coche es: amc rebel sst
4                    el nombre del coche es: ford torino
                             ...
393              el nombre del coche es: ford mustang gl
394                    el nombre del coche es: vw pickup
395                el nombre del coche es: dodge rampage
396                  el nombre del coche es: ford ranger
397                   el nombre del coche es: chevy s-10
Name: nombre, Length: 398, dtype: object